# Taps
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap "buo/cask-upgrade"
tap "yt-dlp/taps"
tap 'wix/brew' # React Native tools

# Binaries
brew 'git'
brew 'gnupg'
brew 'mas' # Mac App Store manager
brew 'openssl@3'
brew 'starship'
brew 'yt-dlp'

# Devtools
brew 'watchman'
brew 'applesimutils'
brew 'ruby-build'
brew 'rbenv'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask '1password'
cask 'vlc'

# Mac App Store
mas "Alfred", id: 405843582
mas "Telegram Lite", id: 946399090
mas "WhatsApp Desktop", id: 1147396723 

